package com.goroscop.astral.utils;

import java.util.HashMap;
import java.util.Map;

public class MetalConst {

    public static final Map<String, String> metalData = new HashMap<>();
    static {
        metalData.put("Овен", "Золото\nЗнак стихии Огня, искренний и отважный Овен горит на работе и дома. " +
                "И только жаркое и яркое, но в то же время гибкое золото способно поддержать неукротимое пламя овновского сердца. " +
                "И подкрепить, и не дать выгореть.");
        metalData.put("Телец", "Алюминий\nХотя Тельцы более других знаков склонны к богатству, им более подходит алюминий, металл авиации. " +
                "Он легко поддается обработке, смягчая непреклонность Тельца. Он мягок, но стоек к прессингу и жесткому воздействию. " +
                "Тельцам, детям Земли, алюминий помогает преодолеть излишние приземленные страхи, взлететь выше.");
        metalData.put("Близнецы", "Серебро\nЭтот металл может подчеркнуть Близнецовскую легкость в общении и сообразительность. " +
                "Но в то же время спасет от ненужных рисков, бессмысленных споров и авантюрных поступков. " +
                "Он поможет талантам воздушных Близнецов засветиться теплым легким сиянием.");
        metalData.put("Рак", "Титан\nДа, именно так. Представителей знака зодиака Рак не заставишь делать что-то вопреки их желаниям. " +
                "Вот почему их металл – сплав титана. Подходит и серебро, но по свойствам оно хуже, чем титан, помогает Ракам идти по жизни.");
        metalData.put("Лев", "Золото Для этих детей Огня золото почти так же полезно, как и для Овнов, принадлежащих той же стихии. " +
                "Но Львы любят золото по-царски! Оно повышает их настроение, повелевает их жизненными силами, оберегает и дарит удачу.");
        metalData.put("Дева", "Мягкие металлы\nДевы – знак Земли, им отлично помогут олово, медь, алюминий, а также и " +
                "золото (его тоже можно отнести к данной категории). Девы предпочитают опираться на анализ фактов, а не на интуицию, " +
                "и мягкие металлы помогут им уравновесить чувства и логику, восстановят баланс между разумом и эмоциями, подчеркнут " +
                "природную мягкость Дев.");
        metalData.put("Весы", "Бронза\nВоздушным Весам не хватает стойкости, которую легко восполняет бронза. " +
                "Кроме того, бронза очень красива, что несомненно привлечет знак, находящийся под покровительством Венеры. " +
                "Также этот металл подарит силы для выполнения любых важных задач.");
        metalData.put("Скорпион", "Сталь и железо\nСкорпионов трудно сломать, они сами буквально «стальные». " +
                "Они обладают острым как бритва умом. Сплавы железа отлично подходят их натуре. И как железо, " +
                "Скорпионы могут поддаваться лишь влиянию времени.");
        metalData.put("Стрелец", "Серебро\nДа, не удивляйтесь – этому независимому, оригинальному и мудрому знаку из металлов " +
                "также отлично подойдет серебро. Стрельцы в серебре обычно более удачливы, и им легче общаться с людьми.");
        metalData.put("Козерог", "Платина\nЭтот металл подчеркнет стойкость Козерогов к влиянию извне: они оба почти «не вступают во " +
                "взаимодействие» с чем-либо. Платина будет оберегать этих детей Земли от невзгод, как талисман поможет Козерогам " +
                "оставаться верными самим себе.");
        metalData.put("Водолей", "Золото и медь\nЗнак воздуха Водолей требует мягких металлов, но не каждый подойдет ему – только избранные. " +
                "Медные амулеты и золотые украшения помогут нашим непризнанным гениям раскрыть свои таланты на земле. " +
                "Началась их эпоха – эра Водолея, медь и золото помогут им вывести свои вибрации до нужного космического уровня.");
        metalData.put("Рыбы", "Серебро\nА что еще лучше подходит серебристым Рыбкам? Оно как амулет хранит рыб от бед и недугов, " +
                "является талисманом удачи в делах. Серебряные изделия – лучший подарок для защиты от трудностей в жизни и " +
                "приманка для любовного счастья.");
    }
}
